org/2015-01-23-topologia-del-plano-complejo.tex
% Created 2015-01-23 vie 09:36
\documentclass[spanish,presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{capt-of}
\tolerance=1000
\usepackage{listings}
\usepackage[mono=false]{libertine}
\usepackage[scaled=0.7]{luximono}
\usepackage{lxfonts}
\usepackage[spanish, mexico, es-noshorthands, english]{babel}
% remove space between margin and lists
\usepackage{enumitem}
\setitemize{label=\usebeamerfont*{itemize item}%
\usebeamercolor[fg]{itemize item}
\usebeamertemplate{itemize item}}
\setlist{leftmargin=*,labelindent=0cm}
\setenumerate[1]{%
label=\protect\usebeamerfont{enumerate item}%
\protect\usebeamercolor[fg]{enumerate item}%
\insertenumlabel.}
\usepackage{tikz}
\usepackage{tikz-cd}
\usepackage{pgfplots}
\usetikzlibrary{babel}
\beamerdefaultoverlayspecification{<+->}
\usefonttheme{professionalfonts}
\usetheme{default}
\usecolortheme{shark}
\useinnertheme[outline,shadow]{chamfered}
\useoutertheme[glossy,nofootline]{wuerzburg}
\date{2015-01-23 7:00}
\title{Topología del plano complejo}
\begin{document}

\maketitle
\setbeamertemplate{navigation symbols}{}
\setbeamertemplate{items}[circle]
\languagepath{spanish}

\tableofcontents

\section{Definiciones básicas}
\label{sec-1}

\begin{frame}[label=sec-1-1]{Discos}
\begin{definition}[Disco]
Sean \(z_{0}\in\mathbb{C}\) y \(r\) un real positivo. Definimos el
\alert{disco} con centro en \(z_{0}\) y radio \(r\), denotado \(D(z_{0},r)\), como
el conjunto:
\begin{displaymath}
D(z_{0},r)=\{z\in\mathbb{C}\mid |z-z_{0}|<r\}.
\end{displaymath}
\end{definition}

\begin{definition}[Disco cerrado]
Sean \(z_{0}\in\mathbb{C}\) y \(r\) un real positivo. Definimos el
\alert{disco cerrado} con centro en \(z_{0}\) y radio \(r\), denotado \(\overline{D}(z_{0},r)\), como
el conjunto:
\begin{displaymath}
\overline{D}(z_{0},r)=\{z\in\mathbb{C}\mid |z-z_{0}|\leq r\}.
\end{displaymath}   
\end{definition}
\end{frame}

\begin{frame}[label=sec-1-2]{Conjuntos abiertos}
\begin{definition}[Punto interior]
Sean \(A\subseteq \mathbb{C}\) y \(z\in \mathbb{C}\). Decimos que
\(z\) es \alert{punto interior} de \(A\) si existe \(r>0\) tal que
\(D(z,r)\subseteq A\).
\end{definition}

\begin{definition}[Conjunto abierto]
Sea \(A\subseteq \mathbb{C}\). Decimos que \(A\) es un \alert{conjunto
abierto} si todo punto de \(A\) es punto interior de \(A\).
\end{definition}

\begin{theorem}[Propiedades de conjuntos abiertos]
\begin{itemize}
\item Si \(\{U_{\alpha}\}_{\alpha\in I}\) es una colección de
conjuntos abiertos, entonces \(\cup_{\alpha\in I}U_{\alpha}\) es un
conjunto abierto.
\item Si \(U_{1},U_{2}\) son abiertos, entonces \(U_{1}\cap U_{2}\) es
abierto.
\end{itemize}
\end{theorem}
\end{frame}

\begin{frame}[label=sec-1-3]{Ejemplos de conjuntos abiertos}
\begin{exampleblock}{}
\begin{itemize}
\item \(\mathbb{C}\) es abierto.
\item \(\emptyset\) es abierto.
\item Para todo \(z\in \mathbb{C}\), \(r>0\), se tiene que \(D(z,r)\)
      es abierto.
\end{itemize}
\end{exampleblock}
\end{frame}

\begin{frame}[label=sec-1-4]{Conjuntos cerrados}
\begin{definition}[Conjunto cerrado]
Sea \(A\subseteq \mathbb{C}\). Decimos que \(A\) es cerrado si su
complemento en \(\mathbb{C}\), es decir, \(\mathbb{C}-A\), es un
conjunto abierto.
\end{definition}

\begin{exampleblock}{}
\begin{itemize}
\item \(\mathbb{C}\) y \(\emptyset\) son cerrados.
\item Para todo \(z\in \mathbb{C}\), \(r>0\), se tiene que \(\overline{D}(z,r)\)
      es cerrado.
\item La circunferencia unitaria \(\{z\in \mathbb{C}\mid |z|=1\}\) es cerrada.
\end{itemize}
\end{exampleblock}

\begin{theorem}
\begin{itemize}
\item Si \(\{F_{\alpha}\}_{\alpha\in I}\) es una colección de
conjuntos cerrados, entonces \(\cap_{\alpha\in I}F_{\alpha}\) es un
conjunto cerrado.
\item Si \(F_{1},F_{2}\) son cerrados, entonces \(F_{1}\cap F_{2}\) es
cerrado.
\end{itemize}
\end{theorem}
\end{frame}

\begin{frame}[label=sec-1-5]{Frontera}
\begin{definition}[Punto frontera]
Sean \(A\subseteq \mathbb{C}\) y \(z\in \mathbb{C}\). Decimos que \(z\) es
un \alert{punto frontera} de \(A\) si para todo \(r>0\) se tiene que
\(A\cap D(z,r)\not=\emptyset\) y \((\mathbb{C}-A)\cap
    D(z,r)\not=\emptyset\). 
\end{definition}

\begin{block}{}
El conjunto de puntos frontera de \(A\) se denota con \(\partial A\).
\end{block}

\begin{exampleblock}{Ejemplo}
\(\partial D(z,r)=\partial \overline{D}(z,r)=\{z\in \mathbb{C}\mid |z|=1\}\)
\end{exampleblock}
\end{frame}

\begin{frame}[label=sec-1-6]{Ejercicios}
\begin{itemize}
\item Demuestra que \(A\subseteq \mathbb{C}\) es abierto si y solo si \(\partial A\cap A=\emptyset\).
\item Demuestra que \(A\subseteq \mathbb{C}\) es cerrado si y solo si \(\partial A\subseteq A\).
\item Demuestra que para todo \(A\subseteq \mathbb{C}\) se tiene que \(\partial A\) es un
conjunto cerrado.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-1-7]{Cerradura}
\begin{definition}[Cerradura]
Sea \(A\subseteq \mathbb{C}\). La \alert{cerradura} de \(A\), denotada
\(\overline{A}\), se define como:
\begin{displaymath}
\overline{A}=A\cup\partial A.
\end{displaymath}
\end{definition}

\begin{exampleblock}{}
Por ejemplo, \(\overline{D(z,r)}=\overline{D}(z,r)\).
\end{exampleblock}

\begin{block}{Ejercicios}
\begin{itemize}
\item Demuestra que \(z\in \overline{A}\) si y solo si \(D(z,r)\cap
      A\ne\emptyset\) para todo \(r>0\).
\item Demuestra que \(\overline{A}\) es cerrado para todo \(A\subseteq \mathbb{C}\).
\item Demuestra que \(A\subseteq \mathbb{C}\) es cerrado si y solo si \(A=\overline{A}\).
\end{itemize}
\end{block}
\end{frame}

\section{Sucesiones}
\label{sec-2}

\begin{frame}[label=sec-2-1]{Definición y notación}
\begin{definition}[Sucesión]
Una \alert{sucesión} en un conjunto \(A\) es una función
\(a\colon\mathbb{N}\to A\). Denotaremos \(a(n)\) como \(a_{n}\) y
a \(a\) como \(\{a_{n}\}\).
\end{definition}

\begin{definition}[Convergencia]
Decimos que la sucesión \(\{a_{n}\}\subseteq \mathbb{C}\) \alert{converge}
a \(z\in\mathbb{C}\) si para todo \(\epsilon>0\) existe \(N\) tal
que \(a_{n}\in D(z,\epsilon)\) para todo \(n\geq N\). Escribimos
\(\lim_{n\to\infty}a_{n}=z\). 
\end{definition}

\begin{block}{Observación}
\(\lim_{n\to\infty}a_{n}=z\) si y solo si \(\lim_{n\to\infty}|a_{n}-z|=0\).
\end{block}
\end{frame}

\begin{frame}[label=sec-2-2]{Propiedades}
\begin{theorem}
\(\lim_{n\to\infty}a_{n}=z\) si y solo si \(\lim_{n\to\infty}\Re
    a_{n}=\Re z\) y \(\lim_{n\to\infty}\Im a_{n}=\Im z\)
\end{theorem}
\end{frame}
% Emacs 24.3.1 (Org mode N/A)
\end{document}